WootingKb/tinyusb/src/portable/st/stm32_fsdev/gd32_fsdev_common.h
#ifndef GD32_FSDEV_COMMON_H_
#define GD32_FSDEV_COMMON_H_

#ifdef GD32F303
#include "gd32f30x.h"
#else
#error "Missing MCU header"
#endif

/**
 * @brief Universal Serial Bus Full Speed Device
 */

typedef struct {
  __IO uint16_t EP0R; /*!< USB Endpoint 0 register,                   Address
                         offset: 0x00 */
  __IO uint16_t RESERVED0; /*!< Reserved */
  __IO uint16_t EP1R; /*!< USB Endpoint 1 register,                   Address
                         offset: 0x04 */
  __IO uint16_t RESERVED1; /*!< Reserved */
  __IO uint16_t EP2R; /*!< USB Endpoint 2 register,                   Address
                         offset: 0x08 */
  __IO uint16_t RESERVED2; /*!< Reserved */
  __IO uint16_t EP3R; /*!< USB Endpoint 3 register,                   Address
                         offset: 0x0C */
  __IO uint16_t RESERVED3; /*!< Reserved */
  __IO uint16_t EP4R; /*!< USB Endpoint 4 register,                   Address
                         offset: 0x10 */
  __IO uint16_t RESERVED4; /*!< Reserved */
  __IO uint16_t EP5R; /*!< USB Endpoint 5 register,                   Address
                         offset: 0x14 */
  __IO uint16_t RESERVED5; /*!< Reserved */
  __IO uint16_t EP6R; /*!< USB Endpoint 6 register,                   Address
                         offset: 0x18 */
  __IO uint16_t RESERVED6; /*!< Reserved */
  __IO uint16_t EP7R; /*!< USB Endpoint 7 register,                   Address
                         offset: 0x1C */
  __IO uint16_t RESERVED7[17]; /*!< Reserved */
  __IO uint16_t CNTR; /*!< Control register,                          Address
                         offset: 0x40 */
  __IO uint16_t RESERVED8; /*!< Reserved */
  __IO uint16_t ISTR; /*!< Interrupt status register,                 Address
                         offset: 0x44 */
  __IO uint16_t RESERVED9; /*!< Reserved */
  __IO uint16_t FNR; /*!< Frame number register,                     Address
                        offset: 0x48 */
  __IO uint16_t RESERVEDA; /*!< Reserved */
  __IO uint16_t DADDR; /*!< Device address register,                   Address
                          offset: 0x4C */
  __IO uint16_t RESERVEDB; /*!< Reserved */
  __IO uint16_t BTABLE; /*!< Buffer Table address register,             Address
                           offset: 0x50 */
  __IO uint16_t RESERVEDC; /*!< Reserved */
} USB_TypeDef;

#define USB_HP_CAN1_TX_IRQn USBD_HP_CAN0_TX_IRQn
#define USB_LP_CAN0_RX0_IRQn USBD_LP_CAN0_RX0_IRQn

#define USB_LP_CAN1_RX0_IRQn USBD_LP_CAN0_RX0_IRQn

#define USB_PMAADDR USBD_RAM_BASE

#define USBWakeUp_IRQn USBD_WKUP_IRQn

#define USB ((USB_TypeDef *)USBD_BASE)

/*!< Endpoint-specific registers */
#define USB_EP0R USB_BASE                /*!< Endpoint 0 register address */
#define USB_EP1R (USB_BASE + 0x00000004) /*!< Endpoint 1 register address */
#define USB_EP2R (USB_BASE + 0x00000008) /*!< Endpoint 2 register address */
#define USB_EP3R (USB_BASE + 0x0000000C) /*!< Endpoint 3 register address */
#define USB_EP4R (USB_BASE + 0x00000010) /*!< Endpoint 4 register address */
#define USB_EP5R (USB_BASE + 0x00000014) /*!< Endpoint 5 register address */
#define USB_EP6R (USB_BASE + 0x00000018) /*!< Endpoint 6 register address */
#define USB_EP7R (USB_BASE + 0x0000001C) /*!< Endpoint 7 register address */

/* bit positions */
#define USB_EP_CTR_RX_Pos (15U)
#define USB_EP_CTR_RX_Msk (0x1UL << USB_EP_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP_CTR_RX USB_EP_CTR_RX_Msk /*!< EndPoint Correct TRansfer RX */
#define USB_EP_DTOG_RX_Pos (14U)
#define USB_EP_DTOG_RX_Msk (0x1UL << USB_EP_DTOG_RX_Pos) /*!< 0x00004000 */
#define USB_EP_DTOG_RX USB_EP_DTOG_RX_Msk /*!< EndPoint Data TOGGLE RX */
#define USB_EPRX_STAT_Pos (12U)
#define USB_EPRX_STAT_Msk (0x3UL << USB_EPRX_STAT_Pos) /*!< 0x00003000 */
#define USB_EPRX_STAT USB_EPRX_STAT_Msk /*!< EndPoint RX STATus bit field */
#define USB_EP_SETUP_Pos (11U)
#define USB_EP_SETUP_Msk (0x1UL << USB_EP_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP_SETUP USB_EP_SETUP_Msk                /*!< EndPoint SETUP */
#define USB_EP_T_FIELD_Pos (9U)
#define USB_EP_T_FIELD_Msk (0x3UL << USB_EP_T_FIELD_Pos) /*!< 0x00000600 */
#define USB_EP_T_FIELD USB_EP_T_FIELD_Msk                /*!< EndPoint TYPE */
#define USB_EP_KIND_Pos (8U)
#define USB_EP_KIND_Msk (0x1UL << USB_EP_KIND_Pos) /*!< 0x00000100 */
#define USB_EP_KIND USB_EP_KIND_Msk                /*!< EndPoint KIND */
#define USB_EP_CTR_TX_Pos (7U)
#define USB_EP_CTR_TX_Msk (0x1UL << USB_EP_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP_CTR_TX USB_EP_CTR_TX_Msk /*!< EndPoint Correct TRansfer TX */
#define USB_EP_DTOG_TX_Pos (6U)
#define USB_EP_DTOG_TX_Msk (0x1UL << USB_EP_DTOG_TX_Pos) /*!< 0x00000040 */
#define USB_EP_DTOG_TX USB_EP_DTOG_TX_Msk /*!< EndPoint Data TOGGLE TX */
#define USB_EPTX_STAT_Pos (4U)
#define USB_EPTX_STAT_Msk (0x3UL << USB_EPTX_STAT_Pos) /*!< 0x00000030 */
#define USB_EPTX_STAT USB_EPTX_STAT_Msk /*!< EndPoint TX STATus bit field */
#define USB_EPADDR_FIELD_Pos (0U)
#define USB_EPADDR_FIELD_Msk                                                   \
  (0xFUL << USB_EPADDR_FIELD_Pos)             /*!< 0x0000000F                  \
                                               */
#define USB_EPADDR_FIELD USB_EPADDR_FIELD_Msk /*!< EndPoint ADDRess FIELD */

/* EndPoint REGister MASK (no toggle fields) */
#define USB_EPREG_MASK                                                         \
  (USB_EP_CTR_RX | USB_EP_SETUP | USB_EP_T_FIELD | USB_EP_KIND |               \
   USB_EP_CTR_TX | USB_EPADDR_FIELD)
/*!< EP_TYPE[1:0] EndPoint TYPE */
#define USB_EP_TYPE_MASK_Pos (9U)
#define USB_EP_TYPE_MASK_Msk                                                   \
  (0x3UL << USB_EP_TYPE_MASK_Pos)             /*!< 0x00000600                  \
                                               */
#define USB_EP_TYPE_MASK USB_EP_TYPE_MASK_Msk /*!< EndPoint TYPE Mask */
#define USB_EP_BULK 0x00000000U               /*!< EndPoint BULK */
#define USB_EP_CONTROL 0x00000200U            /*!< EndPoint CONTROL */
#define USB_EP_ISOCHRONOUS 0x00000400U        /*!< EndPoint ISOCHRONOUS */
#define USB_EP_INTERRUPT 0x00000600U          /*!< EndPoint INTERRUPT */
#define USB_EP_T_MASK (~USB_EP_T_FIELD & USB_EPREG_MASK)

