WootingKb/tinyusb/src/portable/st/stm32_fsdev/gd32_fsdev_common.h
#define USB_EPKIND_MASK                                                        \
  (~USB_EP_KIND & USB_EPREG_MASK)   /*!< EP_KIND EndPoint KIND */
                                    /*!< STAT_TX[1:0] STATus for TX transfer */
#define USB_EP_TX_DIS 0x00000000U   /*!< EndPoint TX DISabled */
#define USB_EP_TX_STALL 0x00000010U /*!< EndPoint TX STALLed */
#define USB_EP_TX_NAK 0x00000020U   /*!< EndPoint TX NAKed */
#define USB_EP_TX_VALID 0x00000030U /*!< EndPoint TX VALID */
#define USB_EPTX_DTOG1 0x00000010U  /*!< EndPoint TX Data TOGgle bit1 */
#define USB_EPTX_DTOG2 0x00000020U  /*!< EndPoint TX Data TOGgle bit2 */
#define USB_EPTX_DTOGMASK (USB_EPTX_STAT | USB_EPREG_MASK)
/*!< STAT_RX[1:0] STATus for RX transfer */
#define USB_EP_RX_DIS 0x00000000U   /*!< EndPoint RX DISabled */
#define USB_EP_RX_STALL 0x00001000U /*!< EndPoint RX STALLed */
#define USB_EP_RX_NAK 0x00002000U   /*!< EndPoint RX NAKed */
#define USB_EP_RX_VALID 0x00003000U /*!< EndPoint RX VALID */
#define USB_EPRX_DTOG1 0x00001000U  /*!< EndPoint RX Data TOGgle bit1 */
#define USB_EPRX_DTOG2 0x00002000U  /*!< EndPoint RX Data TOGgle bit1 */
#define USB_EPRX_DTOGMASK (USB_EPRX_STAT | USB_EPREG_MASK)

/*******************  Bit definition for USB_EP0R register  *******************/
#define USB_EP0R_EA_Pos (0U)
#define USB_EP0R_EA_Msk (0xFUL << USB_EP0R_EA_Pos) /*!< 0x0000000F */
#define USB_EP0R_EA USB_EP0R_EA_Msk                /*!< Endpoint Address */

#define USB_EP0R_STAT_TX_Pos (4U)
#define USB_EP0R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP0R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP0R_STAT_TX                                                       \
  USB_EP0R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP0R_STAT_TX_0 (0x1UL << USB_EP0R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP0R_STAT_TX_1 (0x2UL << USB_EP0R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP0R_DTOG_TX_Pos (6U)
#define USB_EP0R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP0R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP0R_DTOG_TX                                                       \
  USB_EP0R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP0R_CTR_TX_Pos (7U)
#define USB_EP0R_CTR_TX_Msk (0x1UL << USB_EP0R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP0R_CTR_TX                                                        \
  USB_EP0R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP0R_EP_KIND_Pos (8U)
#define USB_EP0R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP0R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP0R_EP_KIND USB_EP0R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP0R_EP_TYPE_Pos (9U)
#define USB_EP0R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP0R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP0R_EP_TYPE                                                       \
  USB_EP0R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP0R_EP_TYPE_0 (0x1UL << USB_EP0R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP0R_EP_TYPE_1 (0x2UL << USB_EP0R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP0R_SETUP_Pos (11U)
#define USB_EP0R_SETUP_Msk (0x1UL << USB_EP0R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP0R_SETUP USB_EP0R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP0R_STAT_RX_Pos (12U)
#define USB_EP0R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP0R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP0R_STAT_RX                                                       \
  USB_EP0R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP0R_STAT_RX_0 (0x1UL << USB_EP0R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP0R_STAT_RX_1 (0x2UL << USB_EP0R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP0R_DTOG_RX_Pos (14U)
#define USB_EP0R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP0R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP0R_DTOG_RX                                                       \
  USB_EP0R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP0R_CTR_RX_Pos (15U)
#define USB_EP0R_CTR_RX_Msk (0x1UL << USB_EP0R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP0R_CTR_RX                                                        \
  USB_EP0R_CTR_RX_Msk /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EP1R register  *******************/
#define USB_EP1R_EA_Pos (0U)
#define USB_EP1R_EA_Msk (0xFUL << USB_EP1R_EA_Pos) /*!< 0x0000000F */
#define USB_EP1R_EA USB_EP1R_EA_Msk                /*!< Endpoint Address */

#define USB_EP1R_STAT_TX_Pos (4U)
#define USB_EP1R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP1R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP1R_STAT_TX                                                       \
  USB_EP1R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP1R_STAT_TX_0 (0x1UL << USB_EP1R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP1R_STAT_TX_1 (0x2UL << USB_EP1R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP1R_DTOG_TX_Pos (6U)
#define USB_EP1R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP1R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP1R_DTOG_TX                                                       \
  USB_EP1R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP1R_CTR_TX_Pos (7U)
#define USB_EP1R_CTR_TX_Msk (0x1UL << USB_EP1R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP1R_CTR_TX                                                        \
  USB_EP1R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP1R_EP_KIND_Pos (8U)
#define USB_EP1R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP1R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP1R_EP_KIND USB_EP1R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP1R_EP_TYPE_Pos (9U)
#define USB_EP1R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP1R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP1R_EP_TYPE                                                       \
  USB_EP1R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP1R_EP_TYPE_0 (0x1UL << USB_EP1R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP1R_EP_TYPE_1 (0x2UL << USB_EP1R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP1R_SETUP_Pos (11U)
#define USB_EP1R_SETUP_Msk (0x1UL << USB_EP1R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP1R_SETUP USB_EP1R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP1R_STAT_RX_Pos (12U)
#define USB_EP1R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP1R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP1R_STAT_RX                                                       \
  USB_EP1R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP1R_STAT_RX_0 (0x1UL << USB_EP1R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP1R_STAT_RX_1 (0x2UL << USB_EP1R_STAT_RX_Pos) /*!< 0x00002000 */

