WootingKb/tinyusb/src/portable/st/stm32_fsdev/gd32_fsdev_common.h
#define USB_EP3R_EP_TYPE_Pos (9U)
#define USB_EP3R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP3R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP3R_EP_TYPE                                                       \
  USB_EP3R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP3R_EP_TYPE_0 (0x1UL << USB_EP3R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP3R_EP_TYPE_1 (0x2UL << USB_EP3R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP3R_SETUP_Pos (11U)
#define USB_EP3R_SETUP_Msk (0x1UL << USB_EP3R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP3R_SETUP USB_EP3R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP3R_STAT_RX_Pos (12U)
#define USB_EP3R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP3R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP3R_STAT_RX                                                       \
  USB_EP3R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP3R_STAT_RX_0 (0x1UL << USB_EP3R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP3R_STAT_RX_1 (0x2UL << USB_EP3R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP3R_DTOG_RX_Pos (14U)
#define USB_EP3R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP3R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP3R_DTOG_RX                                                       \
  USB_EP3R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP3R_CTR_RX_Pos (15U)
#define USB_EP3R_CTR_RX_Msk (0x1UL << USB_EP3R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP3R_CTR_RX                                                        \
  USB_EP3R_CTR_RX_Msk /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EP4R register  *******************/
#define USB_EP4R_EA_Pos (0U)
#define USB_EP4R_EA_Msk (0xFUL << USB_EP4R_EA_Pos) /*!< 0x0000000F */
#define USB_EP4R_EA USB_EP4R_EA_Msk                /*!< Endpoint Address */

#define USB_EP4R_STAT_TX_Pos (4U)
#define USB_EP4R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP4R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP4R_STAT_TX                                                       \
  USB_EP4R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP4R_STAT_TX_0 (0x1UL << USB_EP4R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP4R_STAT_TX_1 (0x2UL << USB_EP4R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP4R_DTOG_TX_Pos (6U)
#define USB_EP4R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP4R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP4R_DTOG_TX                                                       \
  USB_EP4R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP4R_CTR_TX_Pos (7U)
#define USB_EP4R_CTR_TX_Msk (0x1UL << USB_EP4R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP4R_CTR_TX                                                        \
  USB_EP4R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP4R_EP_KIND_Pos (8U)
#define USB_EP4R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP4R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP4R_EP_KIND USB_EP4R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP4R_EP_TYPE_Pos (9U)
#define USB_EP4R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP4R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP4R_EP_TYPE                                                       \
  USB_EP4R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP4R_EP_TYPE_0 (0x1UL << USB_EP4R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP4R_EP_TYPE_1 (0x2UL << USB_EP4R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP4R_SETUP_Pos (11U)
#define USB_EP4R_SETUP_Msk (0x1UL << USB_EP4R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP4R_SETUP USB_EP4R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP4R_STAT_RX_Pos (12U)
#define USB_EP4R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP4R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP4R_STAT_RX                                                       \
  USB_EP4R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP4R_STAT_RX_0 (0x1UL << USB_EP4R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP4R_STAT_RX_1 (0x2UL << USB_EP4R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP4R_DTOG_RX_Pos (14U)
#define USB_EP4R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP4R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP4R_DTOG_RX                                                       \
  USB_EP4R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP4R_CTR_RX_Pos (15U)
#define USB_EP4R_CTR_RX_Msk (0x1UL << USB_EP4R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP4R_CTR_RX                                                        \
  USB_EP4R_CTR_RX_Msk /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EP5R register  *******************/
#define USB_EP5R_EA_Pos (0U)
#define USB_EP5R_EA_Msk (0xFUL << USB_EP5R_EA_Pos) /*!< 0x0000000F */
#define USB_EP5R_EA USB_EP5R_EA_Msk                /*!< Endpoint Address */

#define USB_EP5R_STAT_TX_Pos (4U)
#define USB_EP5R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP5R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP5R_STAT_TX                                                       \
  USB_EP5R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP5R_STAT_TX_0 (0x1UL << USB_EP5R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP5R_STAT_TX_1 (0x2UL << USB_EP5R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP5R_DTOG_TX_Pos (6U)
#define USB_EP5R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP5R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP5R_DTOG_TX                                                       \
  USB_EP5R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP5R_CTR_TX_Pos (7U)
#define USB_EP5R_CTR_TX_Msk (0x1UL << USB_EP5R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP5R_CTR_TX                                                        \
  USB_EP5R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP5R_EP_KIND_Pos (8U)
#define USB_EP5R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP5R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP5R_EP_KIND USB_EP5R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP5R_EP_TYPE_Pos (9U)
#define USB_EP5R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP5R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP5R_EP_TYPE                                                       \
  USB_EP5R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP5R_EP_TYPE_0 (0x1UL << USB_EP5R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP5R_EP_TYPE_1 (0x2UL << USB_EP5R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP5R_SETUP_Pos (11U)
#define USB_EP5R_SETUP_Msk (0x1UL << USB_EP5R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP5R_SETUP USB_EP5R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP5R_STAT_RX_Pos (12U)
#define USB_EP5R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP5R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP5R_STAT_RX                                                       \
  USB_EP5R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP5R_STAT_RX_0 (0x1UL << USB_EP5R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP5R_STAT_RX_1 (0x2UL << USB_EP5R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP5R_DTOG_RX_Pos (14U)
#define USB_EP5R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP5R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP5R_DTOG_RX                                                       \
  USB_EP5R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP5R_CTR_RX_Pos (15U)
#define USB_EP5R_CTR_RX_Msk (0x1UL << USB_EP5R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP5R_CTR_RX                                                        \
  USB_EP5R_CTR_RX_Msk /*!< Correct Transfer for reception */

