WootingKb/tinyusb/src/portable/st/stm32_fsdev/gd32_fsdev_common.h
/*******************  Bit definition for USB_EP6R register  *******************/
#define USB_EP6R_EA_Pos (0U)
#define USB_EP6R_EA_Msk (0xFUL << USB_EP6R_EA_Pos) /*!< 0x0000000F */
#define USB_EP6R_EA USB_EP6R_EA_Msk                /*!< Endpoint Address */

#define USB_EP6R_STAT_TX_Pos (4U)
#define USB_EP6R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP6R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP6R_STAT_TX                                                       \
  USB_EP6R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP6R_STAT_TX_0 (0x1UL << USB_EP6R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP6R_STAT_TX_1 (0x2UL << USB_EP6R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP6R_DTOG_TX_Pos (6U)
#define USB_EP6R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP6R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP6R_DTOG_TX                                                       \
  USB_EP6R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP6R_CTR_TX_Pos (7U)
#define USB_EP6R_CTR_TX_Msk (0x1UL << USB_EP6R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP6R_CTR_TX                                                        \
  USB_EP6R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP6R_EP_KIND_Pos (8U)
#define USB_EP6R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP6R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP6R_EP_KIND USB_EP6R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP6R_EP_TYPE_Pos (9U)
#define USB_EP6R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP6R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP6R_EP_TYPE                                                       \
  USB_EP6R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP6R_EP_TYPE_0 (0x1UL << USB_EP6R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP6R_EP_TYPE_1 (0x2UL << USB_EP6R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP6R_SETUP_Pos (11U)
#define USB_EP6R_SETUP_Msk (0x1UL << USB_EP6R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP6R_SETUP USB_EP6R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP6R_STAT_RX_Pos (12U)
#define USB_EP6R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP6R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP6R_STAT_RX                                                       \
  USB_EP6R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP6R_STAT_RX_0 (0x1UL << USB_EP6R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP6R_STAT_RX_1 (0x2UL << USB_EP6R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP6R_DTOG_RX_Pos (14U)
#define USB_EP6R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP6R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP6R_DTOG_RX                                                       \
  USB_EP6R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP6R_CTR_RX_Pos (15U)
#define USB_EP6R_CTR_RX_Msk (0x1UL << USB_EP6R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP6R_CTR_RX                                                        \
  USB_EP6R_CTR_RX_Msk /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EP7R register  *******************/
#define USB_EP7R_EA_Pos (0U)
#define USB_EP7R_EA_Msk (0xFUL << USB_EP7R_EA_Pos) /*!< 0x0000000F */
#define USB_EP7R_EA USB_EP7R_EA_Msk                /*!< Endpoint Address */

#define USB_EP7R_STAT_TX_Pos (4U)
#define USB_EP7R_STAT_TX_Msk                                                   \
  (0x3UL << USB_EP7R_STAT_TX_Pos) /*!< 0x00000030                              \
                                   */
#define USB_EP7R_STAT_TX                                                       \
  USB_EP7R_STAT_TX_Msk /*!< STAT_TX[1:0] bits (Status bits, for transmission   \
                          transfers) */
#define USB_EP7R_STAT_TX_0 (0x1UL << USB_EP7R_STAT_TX_Pos) /*!< 0x00000010 */
#define USB_EP7R_STAT_TX_1 (0x2UL << USB_EP7R_STAT_TX_Pos) /*!< 0x00000020 */

#define USB_EP7R_DTOG_TX_Pos (6U)
#define USB_EP7R_DTOG_TX_Msk                                                   \
  (0x1UL << USB_EP7R_DTOG_TX_Pos) /*!< 0x00000040                              \
                                   */
#define USB_EP7R_DTOG_TX                                                       \
  USB_EP7R_DTOG_TX_Msk /*!< Data Toggle, for transmission transfers */
#define USB_EP7R_CTR_TX_Pos (7U)
#define USB_EP7R_CTR_TX_Msk (0x1UL << USB_EP7R_CTR_TX_Pos) /*!< 0x00000080 */
#define USB_EP7R_CTR_TX                                                        \
  USB_EP7R_CTR_TX_Msk /*!< Correct Transfer for transmission */
#define USB_EP7R_EP_KIND_Pos (8U)
#define USB_EP7R_EP_KIND_Msk                                                   \
  (0x1UL << USB_EP7R_EP_KIND_Pos)             /*!< 0x00000100                  \
                                               */
#define USB_EP7R_EP_KIND USB_EP7R_EP_KIND_Msk /*!< Endpoint Kind */

#define USB_EP7R_EP_TYPE_Pos (9U)
#define USB_EP7R_EP_TYPE_Msk                                                   \
  (0x3UL << USB_EP7R_EP_TYPE_Pos) /*!< 0x00000600                              \
                                   */
#define USB_EP7R_EP_TYPE                                                       \
  USB_EP7R_EP_TYPE_Msk /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define USB_EP7R_EP_TYPE_0 (0x1UL << USB_EP7R_EP_TYPE_Pos) /*!< 0x00000200 */
#define USB_EP7R_EP_TYPE_1 (0x2UL << USB_EP7R_EP_TYPE_Pos) /*!< 0x00000400 */

#define USB_EP7R_SETUP_Pos (11U)
#define USB_EP7R_SETUP_Msk (0x1UL << USB_EP7R_SETUP_Pos) /*!< 0x00000800 */
#define USB_EP7R_SETUP USB_EP7R_SETUP_Msk /*!< Setup transaction completed */

#define USB_EP7R_STAT_RX_Pos (12U)
#define USB_EP7R_STAT_RX_Msk                                                   \
  (0x3UL << USB_EP7R_STAT_RX_Pos) /*!< 0x00003000                              \
                                   */
#define USB_EP7R_STAT_RX                                                       \
  USB_EP7R_STAT_RX_Msk /*!< STAT_RX[1:0] bits (Status bits, for reception      \
                          transfers) */
#define USB_EP7R_STAT_RX_0 (0x1UL << USB_EP7R_STAT_RX_Pos) /*!< 0x00001000 */
#define USB_EP7R_STAT_RX_1 (0x2UL << USB_EP7R_STAT_RX_Pos) /*!< 0x00002000 */

#define USB_EP7R_DTOG_RX_Pos (14U)
#define USB_EP7R_DTOG_RX_Msk                                                   \
  (0x1UL << USB_EP7R_DTOG_RX_Pos) /*!< 0x00004000                              \
                                   */
#define USB_EP7R_DTOG_RX                                                       \
  USB_EP7R_DTOG_RX_Msk /*!< Data Toggle, for reception transfers */
#define USB_EP7R_CTR_RX_Pos (15U)
#define USB_EP7R_CTR_RX_Msk (0x1UL << USB_EP7R_CTR_RX_Pos) /*!< 0x00008000 */
#define USB_EP7R_CTR_RX                                                        \
  USB_EP7R_CTR_RX_Msk /*!< Correct Transfer for reception */

/*!< Common registers */
/*******************  Bit definition for USB_CNTR register  *******************/
#define USB_CNTR_FRES_Pos (0U)
#define USB_CNTR_FRES_Msk (0x1UL << USB_CNTR_FRES_Pos) /*!< 0x00000001 */
#define USB_CNTR_FRES USB_CNTR_FRES_Msk                /*!< Force USB Reset */
#define USB_CNTR_PDWN_Pos (1U)
#define USB_CNTR_PDWN_Msk (0x1UL << USB_CNTR_PDWN_Pos) /*!< 0x00000002 */
#define USB_CNTR_PDWN USB_CNTR_PDWN_Msk                /*!< Power down */
#define USB_CNTR_LP_MODE_Pos (2U)
#define USB_CNTR_LP_MODE_Msk                                                   \
  (0x1UL << USB_CNTR_LP_MODE_Pos)             /*!< 0x00000004                  \
                                               */
#define USB_CNTR_LP_MODE USB_CNTR_LP_MODE_Msk /*!< Low-power mode */
#define USB_CNTR_FSUSP_Pos (3U)
#define USB_CNTR_FSUSP_Msk (0x1UL << USB_CNTR_FSUSP_Pos) /*!< 0x00000008 */
#define USB_CNTR_FSUSP USB_CNTR_FSUSP_Msk                /*!< Force suspend */
#define USB_CNTR_RESUME_Pos (4U)
#define USB_CNTR_RESUME_Msk (0x1UL << USB_CNTR_RESUME_Pos) /*!< 0x00000010 */
#define USB_CNTR_RESUME USB_CNTR_RESUME_Msk /*!< Resume request */
#define USB_CNTR_ESOFM_Pos (8U)
#define USB_CNTR_ESOFM_Msk (0x1UL << USB_CNTR_ESOFM_Pos) /*!< 0x00000100 */
#define USB_CNTR_ESOFM                                                         \
  USB_CNTR_ESOFM_Msk /*!< Expected Start Of Frame Interrupt Mask */
#define USB_CNTR_SOFM_Pos (9U)
#define USB_CNTR_SOFM_Msk (0x1UL << USB_CNTR_SOFM_Pos) /*!< 0x00000200 */
#define USB_CNTR_SOFM USB_CNTR_SOFM_Msk /*!< Start Of Frame Interrupt Mask */
#define USB_CNTR_RESETM_Pos (10U)
#define USB_CNTR_RESETM_Msk (0x1UL << USB_CNTR_RESETM_Pos) /*!< 0x00000400 */
#define USB_CNTR_RESETM USB_CNTR_RESETM_Msk /*!< RESET Interrupt Mask */
#define USB_CNTR_SUSPM_Pos (11U)
#define USB_CNTR_SUSPM_Msk (0x1UL << USB_CNTR_SUSPM_Pos) /*!< 0x00000800 */
#define USB_CNTR_SUSPM USB_CNTR_SUSPM_Msk /*!< Suspend mode Interrupt Mask */
#define USB_CNTR_WKUPM_Pos (12U)
#define USB_CNTR_WKUPM_Msk (0x1UL << USB_CNTR_WKUPM_Pos) /*!< 0x00001000 */
#define USB_CNTR_WKUPM USB_CNTR_WKUPM_Msk /*!< Wakeup Interrupt Mask */
#define USB_CNTR_ERRM_Pos (13U)
#define USB_CNTR_ERRM_Msk (0x1UL << USB_CNTR_ERRM_Pos) /*!< 0x00002000 */
#define USB_CNTR_ERRM USB_CNTR_ERRM_Msk /*!< Error Interrupt Mask */
#define USB_CNTR_PMAOVRM_Pos (14U)
#define USB_CNTR_PMAOVRM_Msk                                                   \
  (0x1UL << USB_CNTR_PMAOVRM_Pos) /*!< 0x00004000                              \
                                   */
#define USB_CNTR_PMAOVRM                                                       \
  USB_CNTR_PMAOVRM_Msk /*!< Packet Memory Area Over / Underrun Interrupt Mask  \
                        */
#define USB_CNTR_CTRM_Pos (15U)
#define USB_CNTR_CTRM_Msk (0x1UL << USB_CNTR_CTRM_Pos) /*!< 0x00008000 */
#define USB_CNTR_CTRM                                                          \
  USB_CNTR_CTRM_Msk /*!< Correct Transfer Interrupt Mask                       \
                     */

